app/views/items/index.html.erb

                      <td>
                      <% if item.vehicle_details.length > 0 %>
---
SELECT "item_details".* FROM "item_details" WHERE "item_details"."item_id" = $1  [["item_id", 1]]