app/controllers/items_controller.rb

  def create
    params[:item][:remaining_quantity] = params[:item][:quantity]
    @item = Item.new(item_params)
    if @item.save
---
INSERT INTO "items" ("vehicle_type_id", "received_on", "quantity", "description", "created_at", "updated_at", "remaining_quantity") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    if @item.update(item_params)
---
UPDATE "items" SET "vehicle_type_id" = $1, "updated_at" = $2 WHERE "items"."id" = $3  [["vehicle_type_id", "2"], ["updated_at", 2021-09-25 15:54:46.584025538 UTC], ["id", 2]]