app/controllers/item_details_controller.rb

SELECT "item_details".* FROM "item_details"
---
  def index
    @items = Item.all
    @item_details = ItemDetail.all

SELECT "items".* FROM "items"
---
  def new
    @items = Item.all

INSERT INTO "item_details" ("item_id", "chassie_no", "engine_no", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["item_id", 1], ["chassie_no", "ch1"], ["engine_no", "en1"], ["created_at", 2021-09-25 15:45:14.896127316 UTC], ["updated_at", 2021-09-25 15:45:14.896127316 UTC]]
---
  def create
    @item_detail = ItemDetail.new(item_detail_params)

    respond_to do |format|
      if @item_detail.save

SELECT  "item_details".* FROM "item_details" WHERE "item_details"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_item_detail
      @item_detail = ItemDetail.find(params[:id])