app/controllers/orders_controller.rb

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def renew
    @current_user = current_user
    @order = Order.find_by_id(params[:id])

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "items" SET "remaining_quantity" = COALESCE("remaining_quantity", 0) + 1 WHERE "items"."id" = ?  [["id", 1]]
UPDATE "orders" SET "status" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["status", false], ["updated_at", 2021-09-25 10:34:57.394937631 UTC], ["id", 1]]
---
  def disable
    borrowed_qty = Order.find_by_id(params[:id]).quantity.to_i
    @borrowed_item = Order.find_by_id(params[:id]).item
    @borrowed_item.increment!(:remaining_quantity, borrowed_qty)

INSERT INTO "orders" ("quantity", "status", "expire_at", "item_id", "member_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @order = Order.new(order_params)
    if @order.save

SELECT "members".* FROM "members"
---
    def set_data
      @members = Member.all