app/controllers/vehicle_details_controller.rb

  def index
    @items = Item.all
    @vehicle_details = VehicleDetail.all
---
SELECT "items".* FROM "items"
SELECT "vehicle_details".* FROM "vehicle_details"

  def new
    @items = Item.all
---
SELECT "items".* FROM "items"

  def create
    @vehicle_detail = VehicleDetail.new(vehicle_detail_params)

    respond_to do |format|
      if @vehicle_detail.save
---
INSERT INTO "vehicle_details" ("item_id", "chassie_no", "engine_no", "controller_no", "motor_no", "charger_no", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

    def set_vehicle_detail
      @vehicle_detail = VehicleDetail.find(params[:id])
---
SELECT  "vehicle_details".* FROM "vehicle_details" WHERE "vehicle_details"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]